tiled-wallpaper-sources.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-06-12 Mon 15:59 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>tiled wallpaper sources</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:title" content="tiled wallpaper sources">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/warm.png">
<meta property="og:url" content="https://notes.neeasade.net/tiled-wallpaper-sources.html">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='/assets/css/new.css?sum=716dbb6fbb74dcea14c1ee0dc8098072'>
<link rel='stylesheet' href='./assets/css/new.css?sum=716dbb6fbb74dcea14c1ee0dc8098072'>
<link rel='stylesheet' href='/assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='./assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=6ef94b2648dc58ea39219e79af4ef6e9'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=6ef94b2648dc58ea39219e79af4ef6e9'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>../ğš‚ğšƒğš‡</a>
</div>

<div style="float: right">
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/tiled-wallpaper-sources.org">source</a>
</div>
<h1 class=title>tiled wallpaper sources</h1>
<div class="org-center">
<p>

</p>
</div>
<div class=pubinfo>
Published 2021-01-31, last edit <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/tiled-wallpaper-sources.org">2021-04-11</a>
</div>
<hr>
<p>
Tiled wallpapers are quirky, fun, and smol. That last property means you can do fun things to them fast, like programattically apply image filters or <a href="https://github.com/neeasade/dotfiles/blob/a6bbfdad1fc8982bcedbb6e9449823b935d4a166/bin/bin/bgtint">tint</a> them so some current colorscheme.
</p>

<p>
The following is mostly a scraping of this <a href="https://nixers.net/Thread-Tiling-Wallpapers">nixer&rsquo;s thread</a>, and also the <a href="https://rizonrice.club/Rice:Resources#Wallpaper_sources">#rice wiki wallpapers</a> (a tiled subset). The archives are compressed collections hosted on <a href="https:teknik.io">teknik.io</a>. This collection focuses <i>only</i> on tiled patterns.
</p>

<ul class="org-ul">
<li><a href="http://www.colourlovers.com/pattern">colour lovers patterns</a></li>
<li><a href="http://www.heropatterns.com/">hero patterns</a></li>
<li><a href="http://www.stripegenerator.com/">stripe generator</a></li>
<li><a href="https://github.com/BenjaminHCCarr/PropagandaTiles">propaganda tiles</a></li>
<li><a href="https://thepatternlibrary.com/">the pattern library</a></li>
<li><a href="https://github.com/dkeg/bitmap-walls/">dkeg&rsquo;s bitmaps</a></li>
<li><a href="https://github.com/wallace-aph/tiles-and-such">wallace&rsquo;s tiles and such</a></li>
<li><a href="https://www.toptal.com/designers/subtlepatterns/">subtle patterns</a></li>
<li><a href="http://cs.gettysburg.edu/~duncjo01/archive/patterns/">http://cs.gettysburg.edu/~duncjo01/archive/patterns/</a></li>
<li><a href="https://1-background.com/">1-background</a></li>
<li><a href="http://www.tartanmaker.com/">tartan maker</a></li>
<li><del><a href="http://bgrepeat.com">http://bgrepeat.com</a></del> <a href="https://u.teknik.io/FAaP8.7z">archive</a></li>
<li><del><a href="http://squidfingers.com/patterns">http://squidfingers.com/patterns</a></del>  <a href="https://u.teknik.io/QkorA.7z">archive</a></li>
<li><a href="https://u.teknik.io/JPHul.zip">vain&rsquo;s archive</a> (eclipses tiles-and-such(?) and squidfingers)</li>
</ul>

<p>
<div class=separator>âˆ— âˆ— âˆ—</div>
</p>

<p>
For non-tiled sources, I usually go to <a href="https://unsplash.com">unsplash</a> or <a href="https://wallhaven.cc">wallhaven</a>.
</p>

<div class="footer-center">
    
</div>
</div>
</body>
</html>